eks/kustomize/testcase/Test-A/1-percent/canary/RUN-2/k6.log
time="2026-03-12T15:14:49Z" level=warning msg="Insufficient VUs, reached 200 active VUs and cannot initialize more" executor=constant-arrival-rate scenario=baseline_load


  █ TOTAL RESULTS 

    checks_total.......: 6446442 3581.339102/s
    checks_succeeded...: 66.49%  4286708 out of 6446442
    checks_failed......: 33.50%  2159734 out of 6446442

    ✓ shop service response status is 200
    ✗ shop version stable
      ↳  49% — ✓ 526683 / ✗ 547724
    ✗ shop version canary
      ↳  50% — ✓ 547724 / ✗ 526683
    ✗ transaction service response status is 200
      ↳  99% — ✓ 1068947 / ✗ 5460
    ✗ transaction version stable
      ↳  48% — ✓ 522227 / ✗ 552180
    ✗ transaction version canary
      ↳  50% — ✓ 546720 / ✗ 527687

    CUSTOM
    shop_version_count.................: 1074407 596.88985/s
    shop_version_distribution..........: 100.00% 1074407 out of 1074407
    transaction_version_count..........: 1074407 596.88985/s
    transaction_version_distribution...: 100.00% 1074407 out of 1074407

    HTTP
    http_req_blocked...................: avg=5.01µs  min=909ns    med=2.71µs  max=41.46ms p(90)=4.53µs  p(95)=5.17µs  
    http_req_connecting................: avg=721ns   min=0s       med=0s      max=41.44ms p(90)=0s      p(95)=0s      
    http_req_duration..................: avg=4.37ms  min=882.8µs  med=1.21ms  max=2.22s   p(90)=2.37ms  p(95)=5.18ms  
      { expected_response:true }.......: avg=4.38ms  min=882.8µs  med=1.21ms  max=2.22s   p(90)=2.37ms  p(95)=5.18ms  
    http_req_failed....................: 0.25%   5460 out of 2148814
    http_req_receiving.................: avg=50.87µs min=4.51µs   med=23.43µs max=77.08ms p(90)=93.06µs p(95)=136.56µs
    http_req_sending...................: avg=18µs    min=2.81µs   med=7.62µs  max=76.72ms p(90)=17.67µs p(95)=28.61µs 
    http_req_tls_handshaking...........: avg=0s      min=0s       med=0s      max=0s      p(90)=0s      p(95)=0s      
    http_req_waiting...................: avg=4.3ms   min=871.96µs med=1.15ms  max=2.22s   p(90)=2.27ms  p(95)=5.01ms  
    http_reqs..........................: 2148814 1193.779701/s

    EXECUTION
    dropped_iterations.................: 5596    3.108874/s
    iteration_duration.................: avg=8.99ms  min=1.97ms   med=2.69ms  max=2.92s   p(90)=5.73ms  p(95)=13.16ms 
    iterations.........................: 1074407 596.88985/s
    vus................................: 2       min=0                  max=200
    vus_max............................: 200     min=38                 max=200

    NETWORK
    data_received......................: 258 MB  143 kB/s
    data_sent..........................: 215 MB  119 kB/s


  █ SCENARIO: baseline_load 

    checks_total.......: 6446442 3581.339102/s
    checks_succeeded...: 66.49%  4286708 out of 6446442
    checks_failed......: 33.50%  2159734 out of 6446442

    ✓ shop service response status is 200
    ✗ shop version stable
      ↳  49% — ✓ 526683 / ✗ 547724
    ✗ shop version canary
      ↳  50% — ✓ 547724 / ✗ 526683
    ✗ transaction service response status is 200
      ↳  99% — ✓ 1068947 / ✗ 5460
    ✗ transaction version stable
      ↳  48% — ✓ 522227 / ✗ 552180
    ✗ transaction version canary
      ↳  50% — ✓ 546720 / ✗ 527687

    CUSTOM
    shop_version_count.................: 1074407 596.88985/s
    shop_version_distribution..........: 100.00% 1074407 out of 1074407
    transaction_version_count..........: 1074407 596.88985/s
    transaction_version_distribution...: 100.00% 1074407 out of 1074407

    HTTP
    http_req_blocked...................: avg=5.01µs  min=909ns    med=2.71µs  max=41.46ms p(90)=4.53µs  p(95)=5.17µs  
    http_req_connecting................: avg=721ns   min=0s       med=0s      max=41.44ms p(90)=0s      p(95)=0s      
    http_req_duration..................: avg=4.37ms  min=882.8µs  med=1.21ms  max=2.22s   p(90)=2.37ms  p(95)=5.18ms  
    http_req_failed....................: 0.25%   5460 out of 2148814
    http_req_receiving.................: avg=50.87µs min=4.51µs   med=23.43µs max=77.08ms p(90)=93.06µs p(95)=136.56µs
    http_req_sending...................: avg=18µs    min=2.81µs   med=7.62µs  max=76.72ms p(90)=17.67µs p(95)=28.61µs 
    http_req_tls_handshaking...........: avg=0s      min=0s       med=0s      max=0s      p(90)=0s      p(95)=0s      
    http_req_waiting...................: avg=4.3ms   min=871.96µs med=1.15ms  max=2.22s   p(90)=2.27ms  p(95)=5.01ms  
    http_reqs..........................: 2148814 1193.779701/s

    EXECUTION
    dropped_iterations.................: 5596    3.108874/s
    iteration_duration.................: avg=8.99ms  min=1.97ms   med=2.69ms  max=2.92s   p(90)=5.73ms  p(95)=13.16ms 
    iterations.........................: 1074407 596.88985/s

    NETWORK
    data_received......................: 258 MB  143 kB/s
    data_sent..........................: 215 MB  119 kB/s

    ↳ GROUP: shop 

      checks_total.......: 3223221 1790.669551/s
      checks_succeeded...: 66.66%  2148814 out of 3223221
      checks_failed......: 33.33%  1074407 out of 3223221

      ✓ shop service response status is 200
      ✗ shop version stable
          ↳  49% — ✓ 526683 / ✗ 547724
      ✗ shop version canary
          ↳  50% — ✓ 547724 / ✗ 526683

      CUSTOM
      shop_version_count..........: 1074407 596.88985/s
      shop_version_distribution...: 100.00% 1074407 out of 1074407

      HTTP
      http_req_blocked............: avg=5.74µs  min=1.18µs   med=3.22µs  max=34.12ms p(90)=4.95µs  p(95)=5.73µs  
      http_req_connecting.........: avg=685ns   min=0s       med=0s      max=34.08ms p(90)=0s      p(95)=0s      
      http_req_duration...........: avg=4.99ms  min=899.13µs med=1.21ms  max=2.22s   p(90)=2.41ms  p(95)=5.33ms  
      http_req_failed.............: 0.00%   0 out of 1074407
      http_req_receiving..........: avg=52.05µs min=4.51µs   med=24.34µs max=77.08ms p(90)=93.96µs p(95)=134.44µs
      http_req_sending............: avg=17.39µs min=2.99µs   med=8.47µs  max=60.4ms  p(90)=18.37µs p(95)=25.41µs 
      http_req_tls_handshaking....: avg=0s      min=0s       med=0s      max=0s      p(90)=0s      p(95)=0s      
      http_req_waiting............: avg=4.92ms  min=876.7µs  med=1.15ms  max=2.22s   p(90)=2.32ms  p(95)=5.18ms  
      http_reqs...................: 1074407 596.88985/s

    ↳ GROUP: transaction 

      checks_total.......: 3223221 1790.669551/s
      checks_succeeded...: 66.32%  2137894 out of 3223221
      checks_failed......: 33.67%  1085327 out of 3223221

      ✗ transaction service response status is 200
          ↳  99% — ✓ 1068947 / ✗ 5460
      ✗ transaction version stable
          ↳  48% — ✓ 522227 / ✗ 552180
      ✗ transaction version canary
          ↳  50% — ✓ 546720 / ✗ 527687

      CUSTOM
      transaction_version_count..........: 1074407 596.88985/s
      transaction_version_distribution...: 100.00% 1074407 out of 1074407

      HTTP
      http_req_blocked...................: avg=4.28µs  min=909ns    med=2.19µs  max=41.46ms p(90)=3.25µs  p(95)=3.7µs   
      http_req_connecting................: avg=756ns   min=0s       med=0s      max=41.44ms p(90)=0s      p(95)=0s      
      http_req_duration..................: avg=3.75ms  min=882.8µs  med=1.21ms  max=1.26s   p(90)=2.33ms  p(95)=5.02ms  
      http_req_failed....................: 0.50%   5460 out of 1074407
      http_req_receiving.................: avg=49.68µs min=4.59µs   med=22.49µs max=68.47ms p(90)=92.03µs p(95)=138.91µs
      http_req_sending...................: avg=18.6µs  min=2.81µs   med=6.98µs  max=76.72ms p(90)=16.78µs p(95)=37.5µs  
      http_req_tls_handshaking...........: avg=0s      min=0s       med=0s      max=0s      p(90)=0s      p(95)=0s      
      http_req_waiting...................: avg=3.68ms  min=871.96µs med=1.15ms  max=1.26s   p(90)=2.22ms  p(95)=4.84ms  
      http_reqs..........................: 1074407 596.88985/s



time="2026-03-12T15:14:50Z" level=warning msg="Insufficient VUs, reached 200 active VUs and cannot initialize more" executor=constant-arrival-rate scenario=baseline_load


  █ TOTAL RESULTS 

    checks_total.......: 6446484 3581.345457/s
    checks_succeeded...: 66.49%  4286906 out of 6446484
    checks_failed......: 33.50%  2159578 out of 6446484

    ✓ shop service response status is 200
    ✗ shop version stable
      ↳  48% — ✓ 518727 / ✗ 555687
    ✗ shop version canary
      ↳  51% — ✓ 555687 / ✗ 518727
    ✗ transaction service response status is 200
      ↳  99% — ✓ 1069039 / ✗ 5375
    ✗ transaction version stable
      ↳  48% — ✓ 525039 / ✗ 549375
    ✗ transaction version canary
      ↳  50% — ✓ 544000 / ✗ 530414

    CUSTOM
    shop_version_count.................: 1074414 596.890909/s
    shop_version_distribution..........: 100.00% 1074414 out of 1074414
    transaction_version_count..........: 1074414 596.890909/s
    transaction_version_distribution...: 100.00% 1074414 out of 1074414

    HTTP
    http_req_blocked...................: avg=4.75µs  min=921ns    med=2.69µs  max=65.91ms p(90)=4.49µs  p(95)=5.14µs  
    http_req_connecting................: avg=706ns   min=0s       med=0s      max=65.88ms p(90)=0s      p(95)=0s      
    http_req_duration..................: avg=4.33ms  min=883.31µs med=1.21ms  max=2.24s   p(90)=2.31ms  p(95)=4.99ms  
      { expected_response:true }.......: avg=4.33ms  min=883.31µs med=1.21ms  max=2.24s   p(90)=2.31ms  p(95)=5ms     
    http_req_failed....................: 0.25%   5375 out of 2148828
    http_req_receiving.................: avg=49.8µs  min=4.54µs   med=23.22µs max=75.08ms p(90)=91.53µs p(95)=134.63µs
    http_req_sending...................: avg=18.11µs min=2.81µs   med=7.6µs   max=68.84ms p(90)=17.54µs p(95)=28.28µs 
    http_req_tls_handshaking...........: avg=0s      min=0s       med=0s      max=0s      p(90)=0s      p(95)=0s      
    http_req_waiting...................: avg=4.26ms  min=870.85µs med=1.16ms  max=2.24s   p(90)=2.22ms  p(95)=4.84ms  
    http_reqs..........................: 2148828 1193.781819/s

    EXECUTION
    dropped_iterations.................: 5587    3.103859/s
    iteration_duration.................: avg=8.9ms   min=1.96ms   med=2.7ms   max=2.97s   p(90)=5.49ms  p(95)=13.24ms 
    iterations.........................: 1074414 596.890909/s
    vus................................: 1       min=0                  max=200
    vus_max............................: 200     min=37                 max=200

    NETWORK
    data_received......................: 258 MB  143 kB/s
    data_sent..........................: 215 MB  119 kB/s


  █ SCENARIO: baseline_load 

    checks_total.......: 6446484 3581.345457/s
    checks_succeeded...: 66.49%  4286906 out of 6446484
    checks_failed......: 33.50%  2159578 out of 6446484

    ✓ shop service response status is 200
    ✗ shop version stable
      ↳  48% — ✓ 518727 / ✗ 555687
    ✗ shop version canary
      ↳  51% — ✓ 555687 / ✗ 518727
    ✗ transaction service response status is 200
      ↳  99% — ✓ 1069039 / ✗ 5375
    ✗ transaction version stable
      ↳  48% — ✓ 525039 / ✗ 549375
    ✗ transaction version canary
      ↳  50% — ✓ 544000 / ✗ 530414

    CUSTOM
    shop_version_count.................: 1074414 596.890909/s
    shop_version_distribution..........: 100.00% 1074414 out of 1074414
    transaction_version_count..........: 1074414 596.890909/s
    transaction_version_distribution...: 100.00% 1074414 out of 1074414

    HTTP
    http_req_blocked...................: avg=4.75µs  min=921ns    med=2.69µs  max=65.91ms p(90)=4.49µs  p(95)=5.14µs  
    http_req_connecting................: avg=706ns   min=0s       med=0s      max=65.88ms p(90)=0s      p(95)=0s      
    http_req_duration..................: avg=4.33ms  min=883.31µs med=1.21ms  max=2.24s   p(90)=2.31ms  p(95)=4.99ms  
    http_req_failed....................: 0.25%   5375 out of 2148828
    http_req_receiving.................: avg=49.8µs  min=4.54µs   med=23.22µs max=75.08ms p(90)=91.53µs p(95)=134.63µs
    http_req_sending...................: avg=18.11µs min=2.81µs   med=7.6µs   max=68.84ms p(90)=17.54µs p(95)=28.28µs 
    http_req_tls_handshaking...........: avg=0s      min=0s       med=0s      max=0s      p(90)=0s      p(95)=0s      
    http_req_waiting...................: avg=4.26ms  min=870.85µs med=1.16ms  max=2.24s   p(90)=2.22ms  p(95)=4.84ms  
    http_reqs..........................: 2148828 1193.781819/s

    EXECUTION
    dropped_iterations.................: 5587    3.103859/s
    iteration_duration.................: avg=8.9ms   min=1.96ms   med=2.7ms   max=2.97s   p(90)=5.49ms  p(95)=13.24ms 
    iterations.........................: 1074414 596.890909/s

    NETWORK
    data_received......................: 258 MB  143 kB/s
    data_sent..........................: 215 MB  119 kB/s

    ↳ GROUP: shop 

      checks_total.......: 3223242 1790.672728/s
      checks_succeeded...: 66.66%  2148828 out of 3223242
      checks_failed......: 33.33%  1074414 out of 3223242

      ✓ shop service response status is 200
      ✗ shop version stable
          ↳  48% — ✓ 518727 / ✗ 555687
      ✗ shop version canary
          ↳  51% — ✓ 555687 / ✗ 518727

      CUSTOM
      shop_version_count..........: 1074414 596.890909/s
      shop_version_distribution...: 100.00% 1074414 out of 1074414

      HTTP
      http_req_blocked............: avg=5.45µs  min=934ns    med=3.18µs  max=65.91ms p(90)=4.92µs  p(95)=5.58µs  
      http_req_connecting.........: avg=737ns   min=0s       med=0s      max=65.88ms p(90)=0s      p(95)=0s      
      http_req_duration...........: avg=5.03ms  min=884.88µs med=1.21ms  max=2.24s   p(90)=2.39ms  p(95)=5.23ms  
      http_req_failed.............: 0.00%   0 out of 1074414
      http_req_receiving..........: avg=51.35µs min=4.69µs   med=24.43µs max=71.01ms p(90)=94.37µs p(95)=134.67µs
      http_req_sending............: avg=16.86µs min=2.99µs   med=8.36µs  max=68.84ms p(90)=17.86µs p(95)=23.91µs 
      http_req_tls_handshaking....: avg=0s      min=0s       med=0s      max=0s      p(90)=0s      p(95)=0s      
      http_req_waiting............: avg=4.96ms  min=870.85µs med=1.16ms  max=2.24s   p(90)=2.3ms   p(95)=5.08ms  
      http_reqs...................: 1074414 596.890909/s

    ↳ GROUP: transaction 

      checks_total.......: 3223242 1790.672728/s
      checks_succeeded...: 66.33%  2138078 out of 3223242
      checks_failed......: 33.66%  1085164 out of 3223242

      ✗ transaction service response status is 200
          ↳  99% — ✓ 1069039 / ✗ 5375
      ✗ transaction version stable
          ↳  48% — ✓ 525039 / ✗ 549375
      ✗ transaction version canary
          ↳  50% — ✓ 544000 / ✗ 530414

      CUSTOM
      transaction_version_count..........: 1074414 596.890909/s
      transaction_version_distribution...: 100.00% 1074414 out of 1074414

      HTTP
      http_req_blocked...................: avg=4.05µs  min=921ns    med=2.18µs  max=39.33ms p(90)=3.25µs  p(95)=3.72µs  
      http_req_connecting................: avg=674ns   min=0s       med=0s      max=39.31ms p(90)=0s      p(95)=0s      
      http_req_duration..................: avg=3.63ms  min=883.31µs med=1.21ms  max=1.26s   p(90)=2.24ms  p(95)=4.75ms  
      http_req_failed....................: 0.50%   5375 out of 1074414
      http_req_receiving.................: avg=48.25µs min=4.54µs   med=22.04µs max=75.08ms p(90)=88.14µs p(95)=134.58µs
      http_req_sending...................: avg=19.36µs min=2.81µs   med=6.99µs  max=66.06ms p(90)=17.14µs p(95)=41.94µs 
      http_req_tls_handshaking...........: avg=0s      min=0s       med=0s      max=0s      p(90)=0s      p(95)=0s      
      http_req_waiting...................: avg=3.56ms  min=871.98µs med=1.16ms  max=1.26s   p(90)=2.14ms  p(95)=4.59ms  
      http_reqs..........................: 1074414 596.890909/s